h2zero/n-able-Arduino/boards.txt
nRF52840_dongle.name=nRF52840_dongle

nRF52840_dongle.vid.0=0x1915
nRF52840_dongle.pid.0=0x521B
nRF52840_dongle.vid.1=0x1915
nRF52840_dongle.pid.1=0x521F

nRF52840_dongle.upload.tool=nrfutil
nRF52840_dongle.upload.target=nrf52
nRF52840_dongle.upload.maximum_size=913408

nRF52840_dongle.bootloader.tool=nrfutil

nRF52840_dongle.build.mcu=cortex-m4
nRF52840_dongle.build.f_cpu=64000000
nRF52840_dongle.build.board=NRF52840_DONGLE
nRF52840_dongle.build.core=nRF5
nRF52840_dongle.build.variant=nRF52840_Dongle
nRF52840_dongle.build.variant_system_lib=
nRF52840_dongle.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
nRF52840_dongle.build.ldscript=nrf52840_dongle.ld
nRF52840_dongle.build.vid=0x1915
nRF52840_dongle.build.pid=0x521B
nRF52840_dongle.build.usb_manufacturer="Nordic Semiconductor"
nRF52840_dongle.build.usb_product="nRF52840 Dongle"
nRF52840_dongle.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA {build.flags.usb} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}
nRF52840_dongle.build.dfu_pattern={nrfutil.dfu_pattern}

nRF52840_dongle.menu.role.all=All
nRF52840_dongle.menu.role.all.build.nimble_flags=
nRF52840_dongle.menu.role.periph=Peripheral
nRF52840_dongle.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
nRF52840_dongle.menu.role.adv=Advertiser
nRF52840_dongle.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
nRF52840_dongle.menu.role.scan=Scanner
nRF52840_dongle.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
nRF52840_dongle.menu.role.central=Client
nRF52840_dongle.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

nRF52840_dongle.menu.cppDbgLvl.none=None
nRF52840_dongle.menu.cppDbgLvl.none.build.cpp_debug=0
nRF52840_dongle.menu.cppDbgLvl.error=Error
nRF52840_dongle.menu.cppDbgLvl.error.build.cpp_debug=1
nRF52840_dongle.menu.cppDbgLvl.warn=Warn
nRF52840_dongle.menu.cppDbgLvl.warn.build.cpp_debug=2
nRF52840_dongle.menu.cppDbgLvl.info=Info
nRF52840_dongle.menu.cppDbgLvl.info.build.cpp_debug=3
nRF52840_dongle.menu.cppDbgLvl.debug=Debug
nRF52840_dongle.menu.cppDbgLvl.debug.build.cpp_debug=4


BT5040.name=E104-BT5040

BT5040.vid.0=0x1915
BT5040.pid.0=0x521B
BT5040.vid.1=0x1915
BT5040.pid.1=0x521F

BT5040.upload.tool=nrfutil
BT5040.upload.target=nrf52
BT5040.upload.maximum_size=913408

BT5040.bootloader.tool=nrfutil

BT5040.build.mcu=cortex-m4
BT5040.build.f_cpu=64000000
BT5040.build.board=BT5040
BT5040.build.core=nRF5
BT5040.build.variant=nRF52840_Dongle
BT5040.build.variant_system_lib=
BT5040.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
BT5040.build.ldscript=nrf52840_dongle.ld
BT5040.build.vid=0x1915
BT5040.build.pid=0x521B
BT5040.build.usb_manufacturer="Ebyte"
BT5040.build.usb_product="E104-BT5040UA"
BT5040.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA {build.flags.usb} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}
BT5040.build.dfu_pattern={nrfutil.dfu_pattern}

BT5040.menu.role.all=All
BT5040.menu.role.all.build.nimble_flags=
BT5040.menu.role.periph=Peripheral
BT5040.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BT5040.menu.role.adv=Advertiser
BT5040.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BT5040.menu.role.scan=Scanner
BT5040.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BT5040.menu.role.central=Client
BT5040.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BT5040.menu.cppDbgLvl.none=None
BT5040.menu.cppDbgLvl.none.build.cpp_debug=0
BT5040.menu.cppDbgLvl.error=Error
BT5040.menu.cppDbgLvl.error.build.cpp_debug=1
BT5040.menu.cppDbgLvl.warn=Warn
BT5040.menu.cppDbgLvl.warn.build.cpp_debug=2
BT5040.menu.cppDbgLvl.info=Info
BT5040.menu.cppDbgLvl.info.build.cpp_debug=3
BT5040.menu.cppDbgLvl.debug=Debug
BT5040.menu.cppDbgLvl.debug.build.cpp_debug=4


# nRF52833 variants
###################

Generic_nRF52833.name=Generic nRF52833

Generic_nRF52833.upload.tool=openocd
Generic_nRF52833.upload.target=nrf52
Generic_nRF52833.upload.maximum_size=524288

Generic_nRF52833.bootloader.tool=openocd

Generic_nRF52833.build.mcu=cortex-m4
Generic_nRF52833.build.f_cpu=64000000
Generic_nRF52833.build.board=GENERIC
Generic_nRF52833.build.core=nRF5
Generic_nRF52833.build.variant=Generic
Generic_nRF52833.build.variant_system_lib=
Generic_nRF52833.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Generic_nRF52833.build.ldscript=nrf52833_xxaa.ld
Generic_nRF52833.build.extra_flags=-DNRF52_SERIES -DNRF52833_XXAA {build.lfclk_flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

Generic_nRF52833.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF52833.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF52833.menu.lfclk.lfrc=RC Oscillator
Generic_nRF52833.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF52833.menu.lfclk.lfsynt=Synthesized
Generic_nRF52833.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

Generic_nRF52833.menu.role.all=All
Generic_nRF52833.menu.role.all.build.nimble_flags=
Generic_nRF52833.menu.role.periph=Peripheral
Generic_nRF52833.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Generic_nRF52833.menu.role.adv=Advertiser
Generic_nRF52833.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Generic_nRF52833.menu.role.scan=Scanner
Generic_nRF52833.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Generic_nRF52833.menu.role.central=Client
Generic_nRF52833.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Generic_nRF52833.menu.cppDbgLvl.none=None
Generic_nRF52833.menu.cppDbgLvl.none.build.cpp_debug=0
Generic_nRF52833.menu.cppDbgLvl.error=Error
Generic_nRF52833.menu.cppDbgLvl.error.build.cpp_debug=1
Generic_nRF52833.menu.cppDbgLvl.warn=Warn
Generic_nRF52833.menu.cppDbgLvl.warn.build.cpp_debug=2
Generic_nRF52833.menu.cppDbgLvl.info=Info
Generic_nRF52833.menu.cppDbgLvl.info.build.cpp_debug=3
Generic_nRF52833.menu.cppDbgLvl.debug=Debug
Generic_nRF52833.menu.cppDbgLvl.debug.build.cpp_debug=4


