h2zero/n-able-Arduino/boards.txt
nRF52833DK.name=nRF52833 DK (PCA10100)
nRF52833DK.vid.0=0x1366
nRF52833DK.pid.0=0x1015

nRF52833DK.upload.tool=openocd
nRF52833DK.upload.protocol=jlink
nRF52833DK.upload.target=nrf52
nRF52833DK.upload.maximum_size=524288
nRF52833DK.upload.setup_command=transport select swd;

nRF52833DK.bootloader.tool=openocd

nRF52833DK.build.mcu=cortex-m4
nRF52833DK.build.f_cpu=64000000
nRF52833DK.build.board=NRF52833_DK
nRF52833DK.build.core=nRF5
nRF52833DK.build.variant=nRF52833_DK
nRF52833DK.build.variant_system_lib=
nRF52833DK.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
nRF52833DK.build.ldscript=nrf52833_xxaa.ld
nRF52833DK.build.extra_flags=-DNRF52_SERIES -DNRF52833_XXAA -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

nRF52833DK.menu.role.all=All
nRF52833DK.menu.role.all.build.nimble_flags=
nRF52833DK.menu.role.periph=Peripheral
nRF52833DK.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
nRF52833DK.menu.role.adv=Advertiser
nRF52833DK.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
nRF52833DK.menu.role.scan=Scanner
nRF52833DK.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
nRF52833DK.menu.role.central=Client
nRF52833DK.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

nRF52833DK.menu.cppDbgLvl.none=None
nRF52833DK.menu.cppDbgLvl.none.build.cpp_debug=0
nRF52833DK.menu.cppDbgLvl.error=Error
nRF52833DK.menu.cppDbgLvl.error.build.cpp_debug=1
nRF52833DK.menu.cppDbgLvl.warn=Warn
nRF52833DK.menu.cppDbgLvl.warn.build.cpp_debug=2
nRF52833DK.menu.cppDbgLvl.info=Info
nRF52833DK.menu.cppDbgLvl.info.build.cpp_debug=3
nRF52833DK.menu.cppDbgLvl.debug=Debug
nRF52833DK.menu.cppDbgLvl.debug.build.cpp_debug=4


BBCmicrobitV2.name=BBC micro:bit V2

BBCmicrobitV2.vid.0=0x0d28
BBCmicrobitV2.pid.0=0x0204

BBCmicrobitV2.upload.tool=openocd
BBCmicrobitV2.upload.protocol=cmsis-dap
BBCmicrobitV2.upload.target=nrf52
BBCmicrobitV2.upload.maximum_size=524288
BBCmicrobitV2.upload.setup_command=transport select swd;

BBCmicrobitV2.bootloader.tool=openocd

BBCmicrobitV2.build.mcu=cortex-m4
BBCmicrobitV2.build.f_cpu=64000000
BBCmicrobitV2.build.board=BBC_MICROBIT_V2
BBCmicrobitV2.build.core=nRF5
BBCmicrobitV2.build.variant=BBCmicrobitV2
BBCmicrobitV2.build.variant_system_lib=
BBCmicrobitV2.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
BBCmicrobitV2.build.ldscript=nrf52833_xxaa.ld
BBCmicrobitV2.build.extra_flags=-DNRF52_SERIES -DNRF52833_XXAA -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

BBCmicrobitV2.menu.role.all=All
BBCmicrobitV2.menu.role.all.build.nimble_flags=
BBCmicrobitV2.menu.role.periph=Peripheral
BBCmicrobitV2.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BBCmicrobitV2.menu.role.adv=Advertiser
BBCmicrobitV2.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BBCmicrobitV2.menu.role.scan=Scanner
BBCmicrobitV2.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BBCmicrobitV2.menu.role.central=Client
BBCmicrobitV2.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BBCmicrobitV2.menu.cppDbgLvl.none=None
BBCmicrobitV2.menu.cppDbgLvl.none.build.cpp_debug=0
BBCmicrobitV2.menu.cppDbgLvl.error=Error
BBCmicrobitV2.menu.cppDbgLvl.error.build.cpp_debug=1
BBCmicrobitV2.menu.cppDbgLvl.warn=Warn
BBCmicrobitV2.menu.cppDbgLvl.warn.build.cpp_debug=2
BBCmicrobitV2.menu.cppDbgLvl.info=Info
BBCmicrobitV2.menu.cppDbgLvl.info.build.cpp_debug=3
BBCmicrobitV2.menu.cppDbgLvl.debug=Debug
BBCmicrobitV2.menu.cppDbgLvl.debug.build.cpp_debug=4


# nRF51822 variants
###################

Generic_nRF51822.name=Generic nRF51822

Generic_nRF51822.upload.tool=openocd
Generic_nRF51822.upload.target=nrf52
Generic_nRF51822.upload.maximum_size=262144

Generic_nRF51822.bootloader.tool=openocd

Generic_nRF51822.build.mcu=cortex-m0
Generic_nRF51822.build.f_cpu=16000000
Generic_nRF51822.build.board=GENERIC
Generic_nRF51822.build.core=nRF5
Generic_nRF51822.build.variant=Generic
Generic_nRF51822.build.variant_system_lib=
Generic_nRF51822.build.float_flags=
Generic_nRF51822.build.ldscript=nrf51_{build.chip}.ld
Generic_nRF51822.build.extra_flags=-DNRF51 {build.ram_size} {build.lfclk_flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

Generic_nRF51822.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
Generic_nRF51822.menu.chip.xxaa.build.chip=xxaa
Generic_nRF51822.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
Generic_nRF51822.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
Generic_nRF51822.menu.chip.xxac.build.chip=xxac
Generic_nRF51822.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

Generic_nRF51822.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF51822.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF51822.menu.lfclk.lfrc=RC Oscillator
Generic_nRF51822.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF51822.menu.lfclk.lfsynt=Synthesized
Generic_nRF51822.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

Generic_nRF51822.menu.role.all=All
Generic_nRF51822.menu.role.all.build.nimble_flags=
Generic_nRF51822.menu.role.periph=Peripheral
Generic_nRF51822.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Generic_nRF51822.menu.role.adv=Advertiser
Generic_nRF51822.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Generic_nRF51822.menu.role.scan=Scanner
Generic_nRF51822.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Generic_nRF51822.menu.role.central=Client
Generic_nRF51822.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

