h2zero/n-able-Arduino/boards.txt
BLENano.menu.role.all=All
BLENano.menu.role.all.build.nimble_flags=
BLENano.menu.role.periph=Peripheral
BLENano.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BLENano.menu.role.adv=Advertiser
BLENano.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BLENano.menu.role.scan=Scanner
BLENano.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BLENano.menu.role.central=Client
BLENano.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BLENano.menu.cppDbgLvl.none=None
BLENano.menu.cppDbgLvl.none.build.cpp_debug=0
BLENano.menu.cppDbgLvl.error=Error
BLENano.menu.cppDbgLvl.error.build.cpp_debug=1
BLENano.menu.cppDbgLvl.warn=Warn
BLENano.menu.cppDbgLvl.warn.build.cpp_debug=2
BLENano.menu.cppDbgLvl.info=Info
BLENano.menu.cppDbgLvl.info.build.cpp_debug=3
BLENano.menu.cppDbgLvl.debug=Debug
BLENano.menu.cppDbgLvl.debug.build.cpp_debug=4


BluzDK.name=BluzDK

BluzDK.upload.tool=openocd
BluzDK.upload.target=nrf51
BluzDK.upload.maximum_size=262144

BluzDK.bootloader.tool=openocd

BluzDK.build.mcu=cortex-m0
BluzDK.build.f_cpu=16000000
BluzDK.build.board=BLUZ_DK
BluzDK.build.core=nRF5
BluzDK.build.variant=BluzDK
BluzDK.build.variant_system_lib=
BluzDK.build.float_flags=
BluzDK.build.ldscript=nrf51_xxaa.ld
BluzDK.build.extra_flags=-DNRF51 -DDEVICE_RAM_SIZE=16 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

BluzDK.menu.role.all=All
BluzDK.menu.role.all.build.nimble_flags=
BluzDK.menu.role.periph=Peripheral
BluzDK.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BluzDK.menu.role.adv=Advertiser
BluzDK.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BluzDK.menu.role.scan=Scanner
BluzDK.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BluzDK.menu.role.central=Client
BluzDK.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BluzDK.menu.cppDbgLvl.none=None
BluzDK.menu.cppDbgLvl.none.build.cpp_debug=0
BluzDK.menu.cppDbgLvl.error=Error
BluzDK.menu.cppDbgLvl.error.build.cpp_debug=1
BluzDK.menu.cppDbgLvl.warn=Warn
BluzDK.menu.cppDbgLvl.warn.build.cpp_debug=2
BluzDK.menu.cppDbgLvl.info=Info
BluzDK.menu.cppDbgLvl.info.build.cpp_debug=3
BluzDK.menu.cppDbgLvl.debug=Debug
BluzDK.menu.cppDbgLvl.debug.build.cpp_debug=4


CalliopeMini.name=Calliope mini

CalliopeMini.vid.0=0x0d28
CalliopeMini.pid.0=0x0204

CalliopeMini.upload.tool=openocd
CalliopeMini.upload.protocol=cmsis-dap
CalliopeMini.upload.target=nrf51
CalliopeMini.upload.maximum_size=262144
CalliopeMini.upload.setup_command=transport select swd;

CalliopeMini.bootloader.tool=openocd

CalliopeMini.build.mcu=cortex-m0
CalliopeMini.build.f_cpu=16000000
CalliopeMini.build.board=CALLIOPE_MINI
CalliopeMini.build.core=nRF5
CalliopeMini.build.variant=CalliopeMini
CalliopeMini.build.variant_system_lib=
CalliopeMini.build.float_flags=
CalliopeMini.build.ldscript=nrf51_xxaa.ld
CalliopeMini.build.extra_flags=-DNRF51 -DDEVICE_RAM_SIZE=16 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

CalliopeMini.menu.role.all=All
CalliopeMini.menu.role.all.build.nimble_flags=
CalliopeMini.menu.role.periph=Peripheral
CalliopeMini.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
CalliopeMini.menu.role.adv=Advertiser
CalliopeMini.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
CalliopeMini.menu.role.scan=Scanner
CalliopeMini.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
CalliopeMini.menu.role.central=Client
CalliopeMini.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

CalliopeMini.menu.cppDbgLvl.none=None
CalliopeMini.menu.cppDbgLvl.none.build.cpp_debug=0
CalliopeMini.menu.cppDbgLvl.error=Error
CalliopeMini.menu.cppDbgLvl.error.build.cpp_debug=1
CalliopeMini.menu.cppDbgLvl.warn=Warn
CalliopeMini.menu.cppDbgLvl.warn.build.cpp_debug=2
CalliopeMini.menu.cppDbgLvl.info=Info
CalliopeMini.menu.cppDbgLvl.info.build.cpp_debug=3
CalliopeMini.menu.cppDbgLvl.debug=Debug
CalliopeMini.menu.cppDbgLvl.debug.build.cpp_debug=4


ng_beacon.name=ng-beacon

ng_beacon.upload.tool=openocd
ng_beacon.upload.target=nrf51
ng_beacon.upload.maximum_size=262144

ng_beacon.bootloader.tool=openocd

ng_beacon.build.mcu=cortex-m0
ng_beacon.build.f_cpu=16000000
ng_beacon.build.board=NG_BEACON
ng_beacon.build.core=nRF5
ng_beacon.build.variant=ng-beacon
ng_beacon.build.variant_system_lib=
ng_beacon.build.float_flags=
ng_beacon.build.ldscript=nrf51_xxaa.ld
ng_beacon.build.extra_flags=-DNRF51 -DDEVICE_RAM_SIZE=16 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

ng_beacon.menu.role.all=All
ng_beacon.menu.role.all.build.nimble_flags=
ng_beacon.menu.role.periph=Peripheral
ng_beacon.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
ng_beacon.menu.role.adv=Advertiser
ng_beacon.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
ng_beacon.menu.role.scan=Scanner
ng_beacon.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
ng_beacon.menu.role.central=Client
ng_beacon.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

ng_beacon.menu.cppDbgLvl.none=None
ng_beacon.menu.cppDbgLvl.none.build.cpp_debug=0
ng_beacon.menu.cppDbgLvl.error=Error
ng_beacon.menu.cppDbgLvl.error.build.cpp_debug=1
ng_beacon.menu.cppDbgLvl.warn=Warn
ng_beacon.menu.cppDbgLvl.warn.build.cpp_debug=2
ng_beacon.menu.cppDbgLvl.info=Info
ng_beacon.menu.cppDbgLvl.info.build.cpp_debug=3
ng_beacon.menu.cppDbgLvl.debug=Debug
ng_beacon.menu.cppDbgLvl.debug.build.cpp_debug=4


