h2zero/n-able-Arduino/boards.txt
Sinobit.vid.0=0x0d28
Sinobit.pid.0=0x0204

Sinobit.upload.tool=openocd
Sinobit.upload.target=nrf51
Sinobit.upload.maximum_size=262144
Sinobit.upload.protocol=cmsis-dap
Sinobit.upload.setup_command=transport select swd;

Sinobit.bootloader.tool=openocd

Sinobit.build.mcu=cortex-m0
Sinobit.build.f_cpu=16000000
Sinobit.build.board=SINOBIT
Sinobit.build.core=nRF5
Sinobit.build.variant=Sinobit
Sinobit.build.variant_system_lib=
Sinobit.build.float_flags=
Sinobit.build.ldscript=nrf51_xxaa.ld
Sinobit.build.extra_flags=-DNRF51 -DDEVICE_RAM_SIZE=16 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

Sinobit.menu.role.all=All
Sinobit.menu.role.all.build.nimble_flags=
Sinobit.menu.role.periph=Peripheral
Sinobit.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Sinobit.menu.role.adv=Advertiser
Sinobit.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Sinobit.menu.role.scan=Scanner
Sinobit.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Sinobit.menu.role.central=Client
Sinobit.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Sinobit.menu.cppDbgLvl.none=None
Sinobit.menu.cppDbgLvl.none.build.cpp_debug=0
Sinobit.menu.cppDbgLvl.error=Error
Sinobit.menu.cppDbgLvl.error.build.cpp_debug=1
Sinobit.menu.cppDbgLvl.warn=Warn
Sinobit.menu.cppDbgLvl.warn.build.cpp_debug=2
Sinobit.menu.cppDbgLvl.info=Info
Sinobit.menu.cppDbgLvl.info.build.cpp_debug=3
Sinobit.menu.cppDbgLvl.debug=Debug
Sinobit.menu.cppDbgLvl.debug.build.cpp_debug=4


TinyBLE.name=TinyBLE

TinyBLE.upload.tool=openocd
TinyBLE.upload.target=nrf51
TinyBLE.upload.maximum_size=262144
TinyBLE.upload.protocol=cmsis-dap
TinyBLE.upload.setup_command=transport select swd;

TinyBLE.bootloader.tool=openocd

TinyBLE.build.mcu=cortex-m0
TinyBLE.build.f_cpu=16000000
TinyBLE.build.board=TINYBLE
TinyBLE.build.core=nRF5
TinyBLE.build.variant=TinyBLE
TinyBLE.build.variant_system_lib=
TinyBLE.build.float_flags=
TinyBLE.build.ldscript=nrf51_xxaa.ld
TinyBLE.build.extra_flags=-DNRF51 -DDEVICE_RAM_SIZE=16 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

TinyBLE.menu.role.all=All
TinyBLE.menu.role.all.build.nimble_flags=
TinyBLE.menu.role.periph=Peripheral
TinyBLE.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
TinyBLE.menu.role.adv=Advertiser
TinyBLE.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
TinyBLE.menu.role.scan=Scanner
TinyBLE.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
TinyBLE.menu.role.central=Client
TinyBLE.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

TinyBLE.menu.cppDbgLvl.none=None
TinyBLE.menu.cppDbgLvl.none.build.cpp_debug=0
TinyBLE.menu.cppDbgLvl.error=Error
TinyBLE.menu.cppDbgLvl.error.build.cpp_debug=1
TinyBLE.menu.cppDbgLvl.warn=Warn
TinyBLE.menu.cppDbgLvl.warn.build.cpp_debug=2
TinyBLE.menu.cppDbgLvl.info=Info
TinyBLE.menu.cppDbgLvl.info.build.cpp_debug=3
TinyBLE.menu.cppDbgLvl.debug=Debug
TinyBLE.menu.cppDbgLvl.debug.build.cpp_debug=4


Waveshare_BLE400.name=Waveshare BLE400

Waveshare_BLE400.upload.tool=openocd
Waveshare_BLE400.upload.target=nrf51
Waveshare_BLE400.upload.maximum_size=262144

Waveshare_BLE400.bootloader.tool=openocd

Waveshare_BLE400.build.mcu=cortex-m0
Waveshare_BLE400.build.f_cpu=16000000
Waveshare_BLE400.build.board=WAVESHARE_BLE400
Waveshare_BLE400.build.core=nRF5
Waveshare_BLE400.build.variant=Waveshare_BLE400
Waveshare_BLE400.build.variant_system_lib=
Waveshare_BLE400.build.float_flags=
Waveshare_BLE400.build.ldscript=nrf51_{build.chip}.ld
Waveshare_BLE400.build.extra_flags=-DNRF51 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

Waveshare_BLE400.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
Waveshare_BLE400.menu.chip.xxaa.build.chip=xxaa
Waveshare_BLE400.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
Waveshare_BLE400.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
Waveshare_BLE400.menu.chip.xxac.build.chip=xxac
Waveshare_BLE400.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

Waveshare_BLE400.menu.role.all=All
Waveshare_BLE400.menu.role.all.build.nimble_flags=
Waveshare_BLE400.menu.role.periph=Peripheral
Waveshare_BLE400.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Waveshare_BLE400.menu.role.adv=Advertiser
Waveshare_BLE400.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Waveshare_BLE400.menu.role.scan=Scanner
Waveshare_BLE400.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Waveshare_BLE400.menu.role.central=Client
Waveshare_BLE400.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Waveshare_BLE400.menu.cppDbgLvl.none=None
Waveshare_BLE400.menu.cppDbgLvl.none.build.cpp_debug=0
Waveshare_BLE400.menu.cppDbgLvl.error=Error
Waveshare_BLE400.menu.cppDbgLvl.error.build.cpp_debug=1
Waveshare_BLE400.menu.cppDbgLvl.warn=Warn
Waveshare_BLE400.menu.cppDbgLvl.warn.build.cpp_debug=2
Waveshare_BLE400.menu.cppDbgLvl.info=Info
Waveshare_BLE400.menu.cppDbgLvl.info.build.cpp_debug=3
Waveshare_BLE400.menu.cppDbgLvl.debug=Debug
Waveshare_BLE400.menu.cppDbgLvl.debug.build.cpp_debug=4
